In [1]:
import pandas as pd
from sqlalchemy import create_engine
con = create_engine('postgresql+psycopg2://postgres:1234@localhost:5432/dvdrental')
# обертка для команд SQL
def query(sql):
    return pd.read_sql(sql,con)

## 1. ER диаграмма базы данныx DVD RENTAL

![er_diagram](./Untitled.png)

## 2. Таблицы и первичные ключи

| Название таблицы | Первичный ключ |
| --- | --- |
| category | category_id |
| film_category | film_id category_id |
| film | film_id |
| inventory | inventory_id |
| rental | rental_id |
| staff | staff_id |
| payment | payment_id |
| store | store_id |
| address | address_id |
| city | city_id |
| country | country_id |
| customer | customer_id |
| language | language_id |
| film_actor | actor_id film_id |
| actor | actor_id |

## 3. Вывести всех неактивных покупателей

Сведения о покупателях находятся в таблице **customer**. В таблице есть два поля, которые могут говорить об активности покупателя: **activ** и **activbool**.

In [3]:
# количество покупателей со значением false в поле activebool
query('''
SELECT COUNT(customer_id)
FROM customer
WHERE activebool = FALSE;
''')

   count
0      0

In [5]:
# количество покупателей со значением 0 в поле activ
query('''
SELECT COUNT(customer_id)
FROM customer
WHERE active = 0;
''')

   count
0     15

In [13]:
# список покупателей со значением 0 в поле activ
query('''
SELECT first_name ||' '|| last_name AS customer_name, email
FROM customer
WHERE active = 0;
''')

       customer_name                                email
0      Sandra Martin     sandra.martin@sakilacustomer.org
1         Judith Cox        judith.cox@sakilacustomer.org
2       Sheila Wells      sheila.wells@sakilacustomer.org
3     Erica Matthews    erica.matthews@sakilacustomer.org
4       Heidi Larson      heidi.larson@sakilacustomer.org
5         Penny Neal        penny.neal@sakilacustomer.org
6     Kenneth Gooden    kenneth.gooden@sakilacustomer.org
7         Harry Arce        harry.arce@sakilacustomer.org
8      Nathan Runyon     nathan.runyon@sakilacustomer.org
9      Theodore Culp     theodore.culp@sakilacustomer.org
10   Maurice Crawley   maurice.crawley@sakilacustomer.org
11        Ben Easter        ben.easter@sakilacustomer.org
12    Christian Jung    christian.jung@sakilacustomer.org
13  Jimmie Eggleston  jimmie.eggleston@sakilacustomer.org
14    Terrance Roush    terrance.roush@sakilacustomer.org

## 4. Вывести все фильмы, выпущенные в 2006 году

In [7]:
# определим все возможные года выпуска фильмов в базе
query('''
SELECT DISTINCT release_year
FROM film;
''')

   release_year
0          2006

In [17]:
# сейчас в базе присутствует только один год выпуска фильмов - 2006
# можно вывести просто все значения в таблице film 'SELECT * FROM film'
# выведем наименование, рейтинг и спец.признаки по году выпуска фильмов
query('''
SELECT title, rating, special_features
FROM film
WHERE release_year = 2006;
''')

                 title rating                             special_features
0      Chamber Italian  NC-17                                   [Trailers]
1     Grosse Wonderful      R                          [Behind the Scenes]
2      Airport Pollock      R                                   [Trailers]
3    Bright Encounters  PG-13                                   [Trailers]
4     Academy Dinosaur     PG          [Deleted Scenes, Behind the Scenes]
..                 ...    ...                                          ...
995     Young Language      G                [Trailers, Behind the Scenes]
996         Youth Kick  NC-17                [Trailers, Behind the Scenes]
997       Zhivago Core  NC-17                             [Deleted Scenes]
998  Zoolander Fiction      R                   [Trailers, Deleted Scenes]
999          Zorro Ark  NC-17  [Trailers, Commentaries, Behind the Scenes]

[1000 rows x 3 columns]